released/simple_programming_tool/demo_code/M031BSP_USB_HID_Programming_Bridge/SampleCode/Template/m031_bridge_i2c.c
    BridgeI2c_ClearLastError();

    if (read_len != 0)
    {
        *read_len = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (M031BridgeI2c_IsMasterReady(port) == 0u) || ((out == 0) && (len != 0u)))
    {
        return 0u;
    }
    if (len == 0u)
    {
        return 1u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    rx_len = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)((addr7 << 1u) | 0x01u));
                ctrl = I2C_CTL_SI;
                break;

            case 0x40u:
                ctrl = (len == 1u) ? I2C_CTL_SI : I2C_CTL_SI_AA;
                break;

            case 0x50u:
                out[rx_len] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_len;
                ctrl = (rx_len < ((uint32_t)len - 1u)) ? I2C_CTL_SI_AA : I2C_CTL_SI;
                break;

            case 0x58u:
                out[rx_len] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_len;
                ctrl = I2C_CTL_STO_SI;
                xfering = 0u;
                break;

            case 0x48u:
            case 0x38u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    if (read_len != 0)
    {
        *read_len = (uint16_t)rx_len;
    }
    if ((err == 0u) && (rx_len == len))
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

uint8_t M031BridgeI2c_MasterWriteRead(uint8_t port, uint8_t addr7, const uint8_t *tx, uint16_t tx_len,
                                      uint8_t *rx, uint16_t rx_len, uint16_t *read_len, uint8_t repeated_start)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint8_t phase_read;
    uint32_t tx_index;
    uint32_t rx_index;
    uint32_t status;
    uint16_t written;

    BridgeI2c_ClearLastError();

    if (read_len != 0)
    {
        *read_len = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (M031BridgeI2c_IsMasterReady(port) == 0u) ||
        ((tx == 0) && (tx_len != 0u)) ||
        ((rx == 0) && (rx_len != 0u)))
    {
        return 0u;
    }
    if (rx_len == 0u)
    {
        return M031BridgeI2c_MasterWrite(port, addr7, tx, tx_len, &written);
    }
    if (tx_len == 0u)
    {
        return M031BridgeI2c_MasterRead(port, addr7, rx, rx_len, read_len);
    }
    if (repeated_start == 0u)
    {
        if (M031BridgeI2c_MasterWrite(port, addr7, tx, tx_len, &written) == 0u)
        {
            return 0u;
        }
        return M031BridgeI2c_MasterRead(port, addr7, rx, rx_len, read_len);
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    phase_read = 0u;
    tx_index = 0u;
    rx_index = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)(addr7 << 1u));
                ctrl = I2C_CTL_SI;
                break;

            case 0x18u:
            case 0x28u:
                if (tx_index < tx_len)
                {
                    I2C_SET_DATA(i2c, tx[tx_index]);
                    ++tx_index;
                    ctrl = I2C_CTL_SI;
                }
                else
                {
                    phase_read = 1u;
                    ctrl = I2C_CTL_STA_SI;
                }
                break;

            case 0x10u:
                if (phase_read == 0u)
                {
                    BridgeI2c_MarkIoError();
                    err = 1u;
                    ctrl = I2C_CTL_STO_SI;
                }
                else
                {
                    I2C_SET_DATA(i2c, (uint8_t)((addr7 << 1u) | 0x01u));
                    ctrl = I2C_CTL_SI;
                }
                break;

            case 0x40u:
                ctrl = (rx_len == 1u) ? I2C_CTL_SI : I2C_CTL_SI_AA;
                break;

            case 0x50u:
                rx[rx_index] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_index;
                ctrl = (rx_index < ((uint32_t)rx_len - 1u)) ? I2C_CTL_SI_AA : I2C_CTL_SI;
                break;

            case 0x58u:
                rx[rx_index] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_index;
                ctrl = I2C_CTL_STO_SI;
                xfering = 0u;
                break;

            case 0x20u:
            case 0x30u:
            case 0x38u:
            case 0x48u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    if (read_len != 0)
    {
        *read_len = (uint16_t)rx_index;
    }
    if ((err == 0u) && (rx_index == rx_len))
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

uint8_t M031BridgeI2c_PmbusBlockRead(uint8_t port, uint8_t addr7, const uint8_t *tx, uint16_t tx_len,
                                     uint8_t expect_pec, uint8_t max_block_len, uint8_t *out, uint16_t *out_len)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint8_t phase_read;
    uint8_t target_known;
    uint8_t block_count;
    uint16_t target_len;
    uint32_t tx_index;
    uint32_t rx_index;
    uint32_t status;

