released/simple_programming_tool/demo_code/M031BSP_USB_HID_Programming_Bridge/SampleCode/Template/m031_bridge_i2c.c
    BridgeI2c_ClearLastError();

    if (out_len != 0)
    {
        *out_len = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (M031BridgeI2c_IsMasterReady(port) == 0u) || (tx == 0) ||
        (tx_len == 0u) || (out == 0) || (out_len == 0) ||
        (max_block_len == 0u) || (max_block_len > 32u))
    {
        return 0u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    phase_read = 0u;
    target_known = 0u;
    block_count = 0u;
    target_len = 0u;
    tx_index = 0u;
    rx_index = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)(addr7 << 1u));
                ctrl = I2C_CTL_SI;
                break;

            case 0x18u:
            case 0x28u:
                if (tx_index < tx_len)
                {
                    I2C_SET_DATA(i2c, tx[tx_index]);
                    ++tx_index;
                    ctrl = I2C_CTL_SI;
                }
                else
                {
                    phase_read = 1u;
                    ctrl = I2C_CTL_STA_SI;
                }
                break;

            case 0x10u:
                if (phase_read == 0u)
                {
                    BridgeI2c_MarkIoError();
                    err = 1u;
                    ctrl = I2C_CTL_STO_SI;
                }
                else
                {
                    I2C_SET_DATA(i2c, (uint8_t)((addr7 << 1u) | 0x01u));
                    ctrl = I2C_CTL_SI;
                }
                break;

            case 0x40u:
                ctrl = I2C_CTL_SI_AA;
                break;

            case 0x50u:
                out[rx_index] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_index;
                if (target_known == 0u)
                {
                    block_count = out[0];
                    if (block_count > max_block_len)
                    {
                        BridgeI2c_MarkIoError();
                        err = 1u;
                        ctrl = I2C_CTL_STO_SI;
                        break;
                    }
                    target_len = (uint16_t)(1u + block_count + ((expect_pec != 0u) ? 1u : 0u));
                    target_known = 1u;
                }

                if (rx_index >= target_len)
                {
                    ctrl = I2C_CTL_STO_SI;
                    xfering = 0u;
                }
                else
                {
                    ctrl = (rx_index < ((uint32_t)target_len - 1u)) ? I2C_CTL_SI_AA : I2C_CTL_SI;
                }
                break;

            case 0x58u:
                out[rx_index] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_index;
                ctrl = I2C_CTL_STO_SI;
                xfering = 0u;
                break;

            case 0x20u:
            case 0x30u:
            case 0x38u:
            case 0x48u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    *out_len = (uint16_t)rx_index;
    if ((err == 0u) && (target_known != 0u) && (rx_index >= target_len))
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

static uint8_t BridgeI2c_ValidateGroupBlob(const uint8_t *segment_blob, uint16_t blob_len, uint8_t segment_count)
{
    uint16_t offset;
    uint16_t segment_len;
    uint8_t index;

    offset = 0u;
    for (index = 0u; index < segment_count; ++index)
    {
        if ((uint16_t)(offset + 3u) > blob_len)
        {
            return 0u;
        }
        segment_len = Bridge_ReadU16Le(&segment_blob[offset + 1u]);
        if ((segment_len == 0u) || ((uint16_t)(offset + 3u + segment_len) > blob_len))
        {
            return 0u;
        }
        offset = (uint16_t)(offset + 3u + segment_len);
    }
    return (offset == blob_len) ? 1u : 0u;
}

uint8_t M031BridgeI2c_GroupWrite(uint8_t port, const uint8_t *segment_blob, uint16_t blob_len,
                                 uint8_t segment_count, uint8_t *completed_segments)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint8_t index;
    uint8_t addr7;
    uint16_t offset;
    uint16_t segment_len;
    uint16_t data_offset;
    uint16_t tx_index;
    uint32_t status;

    BridgeI2c_ClearLastError();

    if (completed_segments != 0)
    {
        *completed_segments = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) || (segment_blob == 0) ||
        (segment_count == 0u) || (M031BridgeI2c_IsMasterReady(port) == 0u) ||
        (BridgeI2c_ValidateGroupBlob(segment_blob, blob_len, segment_count) == 0u))
    {
        return 0u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    index = 0u;
    offset = 0u;
    addr7 = segment_blob[0] & 0x7Fu;
    segment_len = Bridge_ReadU16Le(&segment_blob[1]);
    data_offset = 3u;
    tx_index = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
            case 0x10u:
                I2C_SET_DATA(i2c, (uint8_t)(addr7 << 1u));
                ctrl = I2C_CTL_SI;
                break;

            case 0x18u:
            case 0x28u:
                if (tx_index < segment_len)
                {
                    I2C_SET_DATA(i2c, segment_blob[data_offset + tx_index]);
                    ++tx_index;
                    ctrl = I2C_CTL_SI;
                }
                else
                {
                    ++index;
                    if (completed_segments != 0)
                    {
                        *completed_segments = index;
                    }
                    if (index >= segment_count)
                    {
                        ctrl = I2C_CTL_STO_SI;
                        xfering = 0u;
                    }
                    else
                    {
                        offset = (uint16_t)(data_offset + segment_len);
                        addr7 = segment_blob[offset] & 0x7Fu;
                        segment_len = Bridge_ReadU16Le(&segment_blob[offset + 1u]);
                        data_offset = (uint16_t)(offset + 3u);
                        tx_index = 0u;
                        ctrl = I2C_CTL_STA_SI;
                    }
                }
                break;

