released/simple_programming_tool/demo_code/M031BSP_USB_HID_Programming_Bridge/SampleCode/Template/m031_bridge_i2c.c
            case 0x20u:
            case 0x30u:
            case 0x38u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    if (err == 0u)
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

uint8_t M031BridgeI2c_BusStatus(uint8_t port, uint8_t recover_if_needed,
                                uint8_t *idle_before, uint8_t *recovered, uint8_t *idle_after)
{
    uint8_t sda_pin;
    uint8_t scl_pin;
    uint8_t idle;
    uint8_t count;
    uint32_t baudrate;
    I2C_T *i2c;

    BridgeI2c_ClearLastError();

    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) || (M031BridgeI2c_IsMasterReady(port) == 0u) ||
        (idle_before == 0) || (recovered == 0) || (idle_after == 0))
    {
        return 0u;
    }

    sda_pin = g_i2c_state[port].sda_pin;
    scl_pin = g_i2c_state[port].scl_pin;
    baudrate = g_i2c_state[port].baudrate;
    i2c = BridgeI2c_GetInst(port);

    idle = ((BridgeI2c_ReadPin(sda_pin) != 0u) && (BridgeI2c_ReadPin(scl_pin) != 0u)) ? 1u : 0u;
    *idle_before = idle;
    *recovered = 0u;

    if ((idle == 0u) && (recover_if_needed != 0u) && (i2c != 0))
    {
        I2C_Close(i2c);
        BridgeI2c_ReleasePin(sda_pin);
        BridgeI2c_ReleasePin(scl_pin);
        BridgeI2c_DelayShort();

        for (count = 0u; count < 9u; ++count)
        {
            BridgeI2c_DrivePinLow(scl_pin);
            BridgeI2c_DelayShort();
            BridgeI2c_ReleasePin(scl_pin);
            BridgeI2c_DelayShort();
        }

        BridgeI2c_DrivePinLow(sda_pin);
        BridgeI2c_DelayShort();
        BridgeI2c_ReleasePin(scl_pin);
        BridgeI2c_DelayShort();
        BridgeI2c_ReleasePin(sda_pin);
        BridgeI2c_DelayShort();

        (void)BridgeI2c_ApplyMux(port, sda_pin, scl_pin);
        (void)I2C_Open(i2c, baudrate);
        I2C_EnableTimeout(i2c, 0u);
        *recovered = 1u;
    }

    *idle_after = ((BridgeI2c_ReadPin(sda_pin) != 0u) && (BridgeI2c_ReadPin(scl_pin) != 0u)) ? 1u : 0u;
    return 1u;
}

uint8_t M031BridgeI2c_SmbusQuick(uint8_t port, uint8_t addr7, uint8_t read_bit, uint8_t *ack)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint32_t status;

    BridgeI2c_ClearLastError();

    if (ack != 0)
    {
        *ack = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (M031BridgeI2c_IsMasterReady(port) == 0u) || (ack == 0))
    {
        return 0u;
    }
    if (read_bit != 0u)
    {
        return BridgeI2c_SmbusQuickReadBitBang(port, addr7, ack);
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)((addr7 << 1u) | ((read_bit != 0u) ? 1u : 0u)));
                ctrl = I2C_CTL_SI;
                break;

            case 0x18u:
            case 0x40u:
                *ack = 1u;
                ctrl = I2C_CTL_STO_SI;
                xfering = 0u;
                break;

            case 0x20u:
            case 0x48u:
                *ack = 0u;
                ctrl = I2C_CTL_STO_SI;
                xfering = 0u;
                break;

            case 0x38u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    if (err == 0u)
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

uint8_t M031BridgeI2c_SlaveSetTx(uint8_t port, const uint8_t *data, uint16_t len, uint16_t *written)
{
    uint16_t index;
    IRQn_Type irq;

    BridgeI2c_ClearLastError();

    if (written != 0)
    {
        *written = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) ||
        (M031BridgeI2c_IsSlaveReady(port) == 0u) ||
        ((data == 0) && (len != 0u)))
    {
        return 0u;
    }
    if (len > M031_BRIDGE_I2C_SLAVE_BUF_SIZE)
    {
        len = M031_BRIDGE_I2C_SLAVE_BUF_SIZE;
    }

    irq = BridgeI2c_GetIrq(port);
    NVIC_DisableIRQ(irq);
    for (index = 0u; index < len; ++index)
    {
        g_i2c_slave_tx[port][index] = data[index];
    }
    g_i2c_slave_tx_len[port] = len;
    g_i2c_slave_tx_index[port] = 0u;
    NVIC_ClearPendingIRQ(irq);
    NVIC_EnableIRQ(irq);

    if (written != 0)
    {
        *written = len;
    }
    return 1u;
}

uint8_t M031BridgeI2c_SlaveGetRx(uint8_t port, uint8_t *out, uint16_t max_len, uint16_t *read_len)
{
    uint16_t index;
    uint16_t count;
    uint16_t remain;
    IRQn_Type irq;

    BridgeI2c_ClearLastError();

    if (read_len != 0)
    {
        *read_len = 0u;
    }
    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) ||
        (M031BridgeI2c_IsSlaveReady(port) == 0u) ||
        ((out == 0) && (max_len != 0u)))
    {
        return 0u;
    }

    irq = BridgeI2c_GetIrq(port);
    NVIC_DisableIRQ(irq);
    count = g_i2c_slave_rx_len[port];
    if (count > max_len)
    {
        count = max_len;
    }

    for (index = 0u; index < count; ++index)
    {
        out[index] = g_i2c_slave_rx[port][index];
    }

    remain = (uint16_t)(g_i2c_slave_rx_len[port] - count);
    for (index = 0u; index < remain; ++index)
    {
        g_i2c_slave_rx[port][index] = g_i2c_slave_rx[port][index + count];
    }
    g_i2c_slave_rx_len[port] = remain;
    NVIC_ClearPendingIRQ(irq);
    NVIC_EnableIRQ(irq);

    if (read_len != 0)
    {
        *read_len = count;
    }
    return 1u;
}

void M031BridgeI2c_IrqHandler(uint8_t port)
{
    I2C_T *i2c;
    uint32_t status;
    uint8_t ctrl;

    if ((port >= M031_BRIDGE_I2C_PORT_COUNT) ||
        (M031BridgeI2c_IsSlaveReady(port) == 0u))
    {
        return;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return;
    }

    status = I2C_GET_STATUS(i2c);
    ctrl = I2C_CTL_SI_AA;

    switch (status)
    {
        case 0x60u:
        case 0x68u:
        case 0x70u:
        case 0x78u:
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0x80u:
        case 0x90u:
            BridgeI2c_SlavePushRx(port, (uint8_t)I2C_GET_DATA(i2c));
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0x88u:
        case 0x98u:
            BridgeI2c_SlavePushRx(port, (uint8_t)I2C_GET_DATA(i2c));
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0xA0u:
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0xA8u:
        case 0xB0u:
            g_i2c_slave_tx_index[port] = 0u;
            I2C_SET_DATA(i2c, BridgeI2c_SlaveNextTx(port));
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0xB8u:
            I2C_SET_DATA(i2c, BridgeI2c_SlaveNextTx(port));
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0xC0u:
        case 0xC8u:
            g_i2c_slave_tx_index[port] = 0u;
            ctrl = I2C_CTL_SI_AA;
            break;

        case 0x00u:
            ctrl = I2C_CTL_STO_SI_AA;
            break;

        default:
            ctrl = I2C_CTL_SI_AA;
            break;
    }

    I2C_SET_CONTROL_REG(i2c, ctrl);
}

void I2C0_IRQHandler(void)
{
    M031BridgeI2c_IrqHandler(0u);
}

void I2C1_IRQHandler(void)
{
    M031BridgeI2c_IrqHandler(1u);
}
